#ifndef _ATC02_H
#define _ATC02_H

void At24c02Init(void);
void At24c02WriteByte(unsigned char addr,unsigned char buff);
void At24c02ReadByte(unsigned char addr,unsigned char *buff);
/*******************************************************************************************************
** 函数: At24c02Write,向指定地址写字符串数据
**------------------------------------------------------------------------------------------------------
** 参数: addr 地址 ，buff 数据指针 ，size 数据长度
** 返回: void
** 说明: AT24C02每页8个字节，每次写操作只能对一页进行，故本函数递归调用写入数据
********************************************************************************************************/
void At24c02Write(unsigned char addr,unsigned char *buff,int size);

/*******************************************************************************************************
** 函数: At24c02Read,从指定地址读取字符串数据
**------------------------------------------------------------------------------------------------------
** 参数: addr 地址 ，buff 数据指针 ，size 数据长度
** 返回: void
********************************************************************************************************/
void At24c02Read(unsigned char addr,unsigned char *buff,int size);
#endif

